Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxCbs_bf.h
/** \brief Length for Ifx_CBS_INTMOD_Bits.TRC_MOD */
#define IFX_CBS_INTMOD_TRC_MOD_LEN (2u)

/** \brief Mask for Ifx_CBS_INTMOD_Bits.TRC_MOD */
#define IFX_CBS_INTMOD_TRC_MOD_MSK (0x3u)

/** \brief Offset for Ifx_CBS_INTMOD_Bits.TRC_MOD */
#define IFX_CBS_INTMOD_TRC_MOD_OFF (21u)

/** \brief Length for Ifx_CBS_INTMOD_Bits.INT_MOD */
#define IFX_CBS_INTMOD_INT_MOD_LEN (1u)

/** \brief Mask for Ifx_CBS_INTMOD_Bits.INT_MOD */
#define IFX_CBS_INTMOD_INT_MOD_MSK (0x1u)

/** \brief Offset for Ifx_CBS_INTMOD_Bits.INT_MOD */
#define IFX_CBS_INTMOD_INT_MOD_OFF (24u)

/** \brief Length for Ifx_CBS_INTMOD_Bits.INT_TRC */
#define IFX_CBS_INTMOD_INT_TRC_LEN (1u)

/** \brief Mask for Ifx_CBS_INTMOD_Bits.INT_TRC */
#define IFX_CBS_INTMOD_INT_TRC_MSK (0x1u)

/** \brief Offset for Ifx_CBS_INTMOD_Bits.INT_TRC */
#define IFX_CBS_INTMOD_INT_TRC_OFF (25u)

/** \brief Length for Ifx_CBS_ICTSA_Bits.ADDR */
#define IFX_CBS_ICTSA_ADDR_LEN (32u)

/** \brief Mask for Ifx_CBS_ICTSA_Bits.ADDR */
#define IFX_CBS_ICTSA_ADDR_MSK (0xffffffffu)

/** \brief Offset for Ifx_CBS_ICTSA_Bits.ADDR */
#define IFX_CBS_ICTSA_ADDR_OFF (0u)

/** \brief Length for Ifx_CBS_ICTTA_Bits.ADDR */
#define IFX_CBS_ICTTA_ADDR_LEN (32u)

/** \brief Mask for Ifx_CBS_ICTTA_Bits.ADDR */
#define IFX_CBS_ICTTA_ADDR_MSK (0xffffffffu)

/** \brief Offset for Ifx_CBS_ICTTA_Bits.ADDR */
#define IFX_CBS_ICTTA_ADDR_OFF (0u)

/** \brief Length for Ifx_CBS_TLC_Bits.TLSP1 */
#define IFX_CBS_TLC_TLSP1_LEN (4u)

/** \brief Mask for Ifx_CBS_TLC_Bits.TLSP1 */
#define IFX_CBS_TLC_TLSP1_MSK (0xfu)

/** \brief Offset for Ifx_CBS_TLC_Bits.TLSP1 */
#define IFX_CBS_TLC_TLSP1_OFF (4u)

/** \brief Length for Ifx_CBS_TLC_Bits.TLSP2 */
#define IFX_CBS_TLC_TLSP2_LEN (4u)

/** \brief Mask for Ifx_CBS_TLC_Bits.TLSP2 */
#define IFX_CBS_TLC_TLSP2_MSK (0xfu)

/** \brief Offset for Ifx_CBS_TLC_Bits.TLSP2 */
#define IFX_CBS_TLC_TLSP2_OFF (8u)

/** \brief Length for Ifx_CBS_TLC_Bits.TLSP3 */
#define IFX_CBS_TLC_TLSP3_LEN (4u)

/** \brief Mask for Ifx_CBS_TLC_Bits.TLSP3 */
#define IFX_CBS_TLC_TLSP3_MSK (0xfu)

/** \brief Offset for Ifx_CBS_TLC_Bits.TLSP3 */
#define IFX_CBS_TLC_TLSP3_OFF (12u)

/** \brief Length for Ifx_CBS_TLC_Bits.TLSP4 */
#define IFX_CBS_TLC_TLSP4_LEN (4u)

/** \brief Mask for Ifx_CBS_TLC_Bits.TLSP4 */
#define IFX_CBS_TLC_TLSP4_MSK (0xfu)

/** \brief Offset for Ifx_CBS_TLC_Bits.TLSP4 */
#define IFX_CBS_TLC_TLSP4_OFF (16u)

/** \brief Length for Ifx_CBS_TLC_Bits.TLSP5 */
#define IFX_CBS_TLC_TLSP5_LEN (4u)

/** \brief Mask for Ifx_CBS_TLC_Bits.TLSP5 */
#define IFX_CBS_TLC_TLSP5_MSK (0xfu)

/** \brief Offset for Ifx_CBS_TLC_Bits.TLSP5 */
#define IFX_CBS_TLC_TLSP5_OFF (20u)

/** \brief Length for Ifx_CBS_TLC_Bits.TLSP6 */
#define IFX_CBS_TLC_TLSP6_LEN (4u)

/** \brief Mask for Ifx_CBS_TLC_Bits.TLSP6 */
#define IFX_CBS_TLC_TLSP6_MSK (0xfu)

/** \brief Offset for Ifx_CBS_TLC_Bits.TLSP6 */
#define IFX_CBS_TLC_TLSP6_OFF (24u)

/** \brief Length for Ifx_CBS_TLC_Bits.TLSP7 */
#define IFX_CBS_TLC_TLSP7_LEN (4u)

/** \brief Mask for Ifx_CBS_TLC_Bits.TLSP7 */
#define IFX_CBS_TLC_TLSP7_MSK (0xfu)

/** \brief Offset for Ifx_CBS_TLC_Bits.TLSP7 */
#define IFX_CBS_TLC_TLSP7_OFF (28u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.C0 */
#define IFX_CBS_TL1ST_C0_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.C0 */
#define IFX_CBS_TL1ST_C0_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.C0 */
#define IFX_CBS_TL1ST_C0_OFF (0u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.C1 */
#define IFX_CBS_TL1ST_C1_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.C1 */
#define IFX_CBS_TL1ST_C1_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.C1 */
#define IFX_CBS_TL1ST_C1_OFF (1u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.C2 */
#define IFX_CBS_TL1ST_C2_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.C2 */
#define IFX_CBS_TL1ST_C2_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.C2 */
#define IFX_CBS_TL1ST_C2_OFF (2u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.C3 */
#define IFX_CBS_TL1ST_C3_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.C3 */
#define IFX_CBS_TL1ST_C3_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.C3 */
#define IFX_CBS_TL1ST_C3_OFF (3u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.C4 */
#define IFX_CBS_TL1ST_C4_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.C4 */
#define IFX_CBS_TL1ST_C4_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.C4 */
#define IFX_CBS_TL1ST_C4_OFF (4u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.C5 */
#define IFX_CBS_TL1ST_C5_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.C5 */
#define IFX_CBS_TL1ST_C5_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.C5 */
#define IFX_CBS_TL1ST_C5_OFF (5u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.M0 */
#define IFX_CBS_TL1ST_M0_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.M0 */
#define IFX_CBS_TL1ST_M0_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.M0 */
#define IFX_CBS_TL1ST_M0_OFF (24u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.M1 */
#define IFX_CBS_TL1ST_M1_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.M1 */
#define IFX_CBS_TL1ST_M1_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.M1 */
#define IFX_CBS_TL1ST_M1_OFF (25u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.M2 */
#define IFX_CBS_TL1ST_M2_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.M2 */
#define IFX_CBS_TL1ST_M2_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.M2 */
#define IFX_CBS_TL1ST_M2_OFF (26u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.HSS1 */
#define IFX_CBS_TL1ST_HSS1_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.HSS1 */
#define IFX_CBS_TL1ST_HSS1_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.HSS1 */
#define IFX_CBS_TL1ST_HSS1_OFF (27u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.HSS0 */
#define IFX_CBS_TL1ST_HSS0_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.HSS0 */
#define IFX_CBS_TL1ST_HSS0_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.HSS0 */
#define IFX_CBS_TL1ST_HSS0_OFF (28u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.DMA */
#define IFX_CBS_TL1ST_DMA_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.DMA */
#define IFX_CBS_TL1ST_DMA_MSK (0x1u)

